.emacs.d/Readme.org
#+title: Emacs configuration with Org Mode
#+author: Nicolas Chapon
#+email: nchapon@gmail.com
#+startup: noinlineimages
#+property: header-args :results silent

* About this document
This is a GNU Emacs configuration file, written as an Org document.
As a result =init.el= and =early-init.el= files are created, located in the same directory as this file, as well as some other files across the system.
You can review which files are created by searching for =:tangle= entries in this document.
Both =init.el= and =early-init.el= and all created files in =./lisp= directory are in read only mode by default, and only this file is meant for editing, and the changes are automatically tangled on save.

Code block below is included in each generatde file :

#+name: nc-header
#+begin_src emacs-lisp
  ;; Author: Nicolas CHAPON
  ;; Keywords: Emacs configuration
  ;; Homepage:

  ;;; Commentary:
  ;; Emacs config file.
  ;; This file was automatically generated by `org-babel-tangle'.
  ;; Do not change this file.  Main config is located in Readme.org at `user-emacs-directory'

  ;;; Code:
#+end_src
** Inspirations
Some parts at this configuration file are copied / adapted from some useful configuration :
- https://www.lucacambiaghi.com/vanilla-emacs/readme.html
- [[https://github.com/MatthewZMD/.emacs.d]]
- https://gitlab.imt-atlantique.fr/jnbazin/emacs-config/-/blob/master/emacs-init.org (french)

* Early Init

Emacs 27 introduced new initialization file called =early-init.el=, which is executed before =init.el=.
It is meant to configure package initialization and early graphical interface tweaks, before actually drawing a window.

#+begin_src emacs-lisp :tangle early-init.el :noweb yes
  ;;; early-init.el --- Early initialization -*- lexical-binding: t; buffer-read-only: t; no-byte-compile: t -*-

  <<nc-header>>
#+end_src

** Garbage Collection and Performance
One of the main reasons why Emacs startup time is big is that the garbage collection is invoked a lot, causing the increase of the startup time.
This can be migrated by setting high GC threshold and restoring it back in =after-init-hook=.

#+begin_src emacs-lisp :tangle early-init.el
  (defvar nc--gc-cons-threshold gc-cons-threshold)
  (defvar nc--gc-cons-percentage gc-cons-percentage)
  (defvar nc--file-name-handler-alist file-name-handler-alist)

  (setq-default gc-cons-threshold 402653184
                gc-cons-percentage 0.6
                file-name-handler-alist nil)

  (defun nc/restore-defaults-after-init ()
    "Restore default values after initialization."
    (setq-default gc-cons-threshold nc--gc-cons-threshold
                  gc-cons-percentage nc--gc-cons-percentage
                  file-name-handler-alist nc--file-name-handler-alist))

  (add-hook 'after-init-hook #'nc/restore-defaults-after-init)

  (setq read-process-output-max (* 1024 1024 4) ; 4mb
        inhibit-compacting-font-caches t
        message-log-max 16384)
#+end_src

** Straight
Straight is an alternative way to manage package installations.
It can install packages from Git repositories listed on ELPA, MELPA, and directly from Git URLs.

#+begin_src emacs-lisp :tangle early-init.el
  (defvar straight-process-buffer)
  (setq-default straight-process-buffer " *straight-process*")

  (defvar straight-build-dir)
  (setq straight-build-dir (format "build-%s" emacs-version))

  (defvar bootstrap-version)
  (let ((bootstrap-file
     (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
    (bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
      (url-retrieve-synchronously
       "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
       'silent 'inhibit-cookies)
    (goto-char (point-max))
    (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))
#+end_src

** Early =package.el= settings
=package.el= initialization is expensive, thus should be disabled before loading main init file:

#+begin_src emacs-lisp :tangle early-init.el
  (setq package-enable-at-startup nil)
#+end_src

** Loading of elisp files
Prefer loading newer files to the byte-compiled ones that have older time-stamp when running non-interactively to prevent the use of stale byte-code.
Saves us a little IO time to skip the mtime checks on every =*.elc= file.

#+begin_src emacs-lisp :tangle early-init.el
  (setq load-prefer-newer noninteractive)
#+end_src

** Provide early-init
This concludes the =early-init.el= file.

#+begin_src emacs-lisp :tangle early-init.el
  (provide 'early-init)
  ;;; early-init.el ends here
#+end_src

* Init configuration
:properties:
:header-args+: :tangle "./init.el"
:end:
Main GNU Emacs init file =init.el=.

#+begin_src emacs-lisp :noweb yes
  ;;; init.el --- Emacs main configuration file -*- lexical-binding: t; buffer-read-only: t; no-byte-compile: t -*-

  <<nc-header>>
#+end_src


** Loading =early-init.el= in Emacs 26 and earlier
When using pre Emacs 27 =eraly-init.el= must be loaded manually before anything from =init.el=.

#+begin_src emacs-lisp
  (unless (featurep 'early-init)
    (load (expand-file-name "early-init" user-emacs-directory)))
#+end_src

** Package Management
*** =use-package=
A macro for managing installed packages, and encapsulating their configurations.

#+begin_src emacs-lisp
  (straight-use-package 'use-package)
  (defvar straight-use-package-by-default)
  (setq straight-use-package-by-default t)
  (require 'use-package)
#+end_src
*** Diminish
Remove minor modes from mode line
#+begin_src emacs-lisp
(use-package diminish)
#+end_src

** Exec Path From Shell

[[https://github.com/purcell/exec-path-from-shell][Exec Path From Shell]] A GNU Emacs library to ensure environment variables inside Emacs look the same as in the user's shell.

This happens a lot on OS X, where an Emacs instance started from the GUI inherits a default set of environment variables.

#+begin_src emacs-lisp
  (use-package exec-path-from-shell
    :config
    (when (memq window-system '(mac ns x))
      (progn
        (exec-path-from-shell-initialize)
        ;; (exec-path-from-shell-copy-env "GOPATH")
        ;;(exec-path-from-shell-copy-env "JAVA_HOME")
        (exec-path-from-shell-copy-env "XDG_CONFIG_HOME")
        )))
#+end_src

** No Littering
:PROPERTIES:
:ID:       3f627579-3efc-4c40-9dbe-558de5359f8e
:END:

Help keeping =~/.emacs.d= clean.
[[https://github.com/emacscollective/no-littering][https://github.com/emacscollective/no-littering]]

#+begin_src emacs-lisp
(use-package no-littering)
#+end_src
** Setup modules

Add setup modules and conclude the =init.el= file.

#+begin_src emacs-lisp
  (add-to-list 'load-path (expand-file-name "lisp" user-emacs-directory))

  (require 'setup-prefs)
  (require 'setup-ui)
  (require 'setup-keys)
  (require 'setup-windows)
  (require 'setup-core)
  (require 'setup-completion)
  (require 'setup-org)
  (require 'setup-programming)
  (require 'setup-shell)
  (require 'setup-functions)

  (provide 'init)
  ;;; init.el ends here
#+end_src

* Global Preferences
:properties:
:header-args+: :tangle "./lisp/setup-prefs.el"
:end:

Global preferences module automatically tangled in =./lisp/setup-prefs.el=
#+begin_src emacs-lisp :noweb yes
  ;;; setup-prefs.el --- Global Preferences module -*- lexical-binding: t; buffer-read-only: t; no-byte-compile: t -*-

  <<nc-header>>
#+end_src

** Personal Information
 #+begin_src emacs-lisp
 (setq user-full-name "Nicolas Chapon"
         user-mail-address "nchapon@gmail.com")
 #+end_src

** Define constants

#+begin_src emacs-lisp
  (defconst is-mac (equal system-type 'darwin))
  (defconst is-linux (equal system-type 'gnu/linux))
  (defconst is-windows (equal system-type 'windows-nt))
  (defconst has-gui (display-graphic-p))
#+end_src
** Customization File
To avoid overloading the GNU Emacs custormization =init.el= file made by the
user with the UI, I add the generated code in a separate file.

#+begin_src emacs-lisp
  (setq-default custom-file (expand-file-name "custom.el" user-emacs-directory))
  (when (file-exists-p custom-file)
    (load custom-file t))
#+end_src
** Better Defaults
Small configs for better emacs experience...

#+begin_src emacs-lisp
  (setq initial-major-mode 'lisp-interaction-mode
        redisplay-dont-pause t
        column-number-mode t
        echo-keystrokes 0.02
        fill-column 80
        transient-mark-mode t
        shift-select-mode nil
        require-final-newline t
        truncate-partial-width-windows nil
        delete-by-moving-to-trash t
        confirm-nonexistent-file-or-buffer nil
        query-replace-highlight t
        ;; do not create lock files
        create-lockfiles nil
        ring-bell-function 'ignore
        sentence-end-double-space nil)
 #+end_src
*** Tab Defaults

#+begin_src emacs-lisp
  (setq-default tab-width 4)
#+end_src

*** Transparently open compressed files
 #+begin_src emacs-lisp
 (auto-compression-mode t)
 #+end_src

*** Answering just 'y' or 'n'

 #+begin_src emacs-lisp
 (defalias 'yes-or-no-p 'y-or-n-p)
 #+end_src

*** Indentation & Tabs

 Always spaces with width of 4
 #+begin_src emacs-lisp
 (setq-default indent-tabs-mode nil)
 (setq-default tab-width 4)
 #+end_src
*** TODO Indent new line if necessary
Remove to bindings
#+begin_src emacs-lisp
 (define-key global-map (kbd "RET") 'newline-and-indent)
 #+end_src
*** Backup Files
Backup files in  [[id:3f627579-3efc-4c40-9dbe-558de5359f8e][no Littering]] folder
#+begin_src emacs-lisp
(setq backup-directory-alist '(("." . "~/.emacs.d/var/backups/")))
#+end_src
** UTF-8 Encoding

 Set all coding systems to utf-8
 #+begin_src emacs-lisp
 (prefer-coding-system 'utf-8-unix)
 (set-clipboard-coding-system 'utf-8-unix)
 (set-default-coding-systems 'utf-8-unix)
 (set-keyboard-coding-system 'utf-8-unix)
 (set-language-environment 'utf-8)
 (set-selection-coding-system 'utf-8-unix)
 (set-terminal-coding-system 'utf-8-unix)
 (setq locale-coding-system 'utf-8-unix)
 (setq coding-system-for-write 'utf-8-unix)
 (setq default-buffer-file-coding-system 'utf-8-unix)
 (setq default-process-coding-system '(utf-8-unix . utf-8-unix))
 (setq file-name-coding-system  'utf-8)
 #+end_src
** French Calendar & Holydays
 French Calendar & Holidays
 #+begin_src emacs-lisp
   (setq calendar-week-start-day 1
         calendar-day-name-array ["Dimanche" "Lundi" "Mardi" "Mercredi"
                                  "Jeudi" "Vendredi" "Samedi"]
         calendar-month-name-array ["Janvier" "Fevrier" "Mars" "Avril" "Mai"
                                    "Juin" "Juillet" "Aout" "Septembre"
                                    "Octobre" "Novembre" "Decembre"])
 #+end_src

 #+begin_src emacs-lisp
   (defvar french-holiday
     '((holiday-fixed 1 1 "Jour de l'an")
       (holiday-fixed 5 1 "Fête du travail")
       (holiday-fixed 5 8 "Victoire 45")
       (holiday-fixed 7 14 "Fête nationale")
       (holiday-fixed 8 15 "Assomption")
       (holiday-fixed 11 1 "Toussaint")
       (holiday-fixed 11 11 "Armistice 18")
       (holiday-fixed 12 25 "Noël")
       (holiday-easter-etc 1 "Lundi de Pâques")
       (holiday-easter-etc 39 "Ascension")
       (holiday-easter-etc 50 "Lundi de Pentecôte")))

   (setq calendar-date-style 'european
         calendar-holidays french-holiday
         calendar-mark-holidays-flag t
         calendar-mark-diary-entries-flag t)

 #+end_src


** MacOS
Some custom preferences dedicated to MacOS
- keys for apple keyboard
- use the right ~⌥~ key to write symbols ={[]}=. The left ~⌥~ key can be used as the Meta
- GPG
- ...

 #+begin_src emacs-lisp
   (when is-mac
     ;; Keys for Appel keyboard
     (setq mac-command-modifier 'meta)    ; make cmd key do Meta
     (setq mac-option-modifier 'super)    ; make opt key do Super
     (setq mac-control-modifier 'control) ; make Control key do Control
     (setq ns-function-modifier 'hyper)   ; make Fn key do Hyper

     (setq trash-directory "~/.Trash")    ; Trash Directory
  
     ;; Write Symbols [{}]
     (setq-default mac-right-option-modifier nil)

     ;; GPG
     (setf epa-pinentry-mode 'loopback)

     ;; Freench Locale
     (set-locale-environment "fr_FR.UTF-8"))
 #+end_src
** Uniquify

Uniquify file path to ensure buffer name uniqueness

#+begin_src emacs-lisp
  (use-package uniquify
    :straight nil
    :custom
    (uniquify-buffer-name-style 'forward)
    (uniquify-separator "/")
    (uniquify-after-kill-buffer-p t)
    (uniquify-ignore-buffers-re "^\\*")
  )
#+end_src
** Recent Files

 #+BEGIN_QUOTE
 Recentf is a minor mode that builds a list of recently opened
 files. This list is is automatically saved across sessions on exiting
 Emacs - you can then access this list through a command or the menu.

 [[https://www.emacswiki.org/emacs/RecentFiles][https://www.emacswiki.org/emacs/RecentFiles]]
 #+END_QUOTE

 #+begin_src emacs-lisp
   (use-package recentf
     :straight nil
     :custom
     (recentf-auto-cleanup "09:00am")
     (recentf-max-saved-items 300)
     (recentf-exclude '((expand-file-name package-user-dir)
                        ".cache"
                        ".cask"
                        ".elfeed"
                        "bookmarks"
                        "cache"
                        "ido.*"
                        "persp-confs"
                        "recentf"
                        "undo-tree-hist"
                        "url"
                        "COMMIT_EDITMSG\\'")))

   ;; When buffer is closed, saves the cursor location
   (save-place-mode 1)

   (recentf-mode 1)

   ;; Set history-length longer
   (setq-default history-length 500)

 #+end_src
** Repeat Mode
Toggle Repeat Mode
#+begin_src emacs-lisp
  (repeat-mode)
#+end_src
 
* UI
:properties:
:header-args+: :tangle "./lisp/setup-ui.el"
:end:

UI configuration module automatically tangled in =./lisp/setup-ui.el=

#+begin_src emacs-lisp :noweb yes
  ;;; setup-ui.el --- UI configuration module -*- lexical-binding: t; buffer-read-only: t; no-byte-compile: t -*-

  <<nc-header>>
#+end_src
** Minimalistic UI
*** No menu and toolbar

#+begin_src emacs-lisp
(if (fboundp 'scroll-bar-mode) (scroll-bar-mode -1))
(if (fboundp 'tool-bar-mode) (tool-bar-mode -1))
(if (fboundp 'menu-bar-mode) (menu-bar-mode -1))
#+end_src

*** No welcome screen

#+begin_src emacs-lisp
(setq  inhibit-startup-message t)
#+end_src

*** Make fringe smaller

#+begin_src emacs-lisp
  (if (fboundp 'fringe-mode)
      (fringe-mode 2))
#+end_src
** All The Icons
#+begin_src emacs-lisp
(use-package all-the-icons)
#+end_src
