.emacs.d/Readme.org
** Theme
Using moe theme dark all the day
#+begin_src emacs-lisp
  (use-package doom-themes

    :config

    ;; Global settings (defaults)
    (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
          doom-themes-enable-italic t) ; if nil, italics is universally disabled

    ;; Load the theme (doom-one, doom-molokai, etc); keep in mind that each theme
    ;; may have their own settings.
    (load-theme 'doom-one t)

    ;; Enable flashing mode-line on errors
    (doom-themes-visual-bell-config)

    ;; or for treemacs users
    (setq doom-themes-treemacs-theme "doom-colors") ; use the colorful treemacs theme
    (doom-themes-treemacs-config)
    ;;(doom-themes-treemacs-config)

    ;; Corrects (and improves) org-mode's native fontification.
    (with-eval-after-load 'org-mode
        (doom-themes-org-config))
    )
#+end_src
** Mode line
#+begin_src emacs-lisp
  (use-package doom-modeline
    :hook (after-init . doom-modeline-mode))
#+end_src

** Font

#+begin_src emacs-lisp
  (defun nc/setup-font ()
    "Set up font height"
    (interactive)
    (when is-linux
      (set-frame-font "Jetbrains Mono 13" nil t))
    (when is-mac
      (if (> (display-pixel-width) 2500)
          (set-frame-font "Jetbrains Mono 16" nil t)
          (set-frame-font "Jetbrains Mono 14" nil t)))
    (when is-windows
      (set-frame-font "Jetbrains Mono 10" nil t))
    )

  (when has-gui
    (add-hook 'after-init-hook #'nc/setup-font))
#+end_src
** Emojify

ℹ️ All-The-Icons and Noto Emoji should be installed

#+begin_src emacs-lisp
  (setf use-default-font-for-symbols nil)
  (set-fontset-font t 'unicode "Noto Emoji" nil 'append)

  (use-package emojify
      :hook (after-init . global-emojify-mode)
      :config

      (set-fontset-font "fontset-default" 'symbol "Noto Color Emoji" nil 'append)
      (set-fontset-font "fontset-default" 'symbol "Symbola" nil 'append)
      (set-fontset-font t 'unicode (font-spec :family "all-the-icons") nil 'append)
      (set-fontset-font t 'unicode (font-spec :family "file-icons") nil 'append)
      (set-fontset-font t 'unicode (font-spec :family "Material Icons") nil 'append)
      (set-fontset-font t 'unicode (font-spec :family "github-octicons") nil 'append)
      (set-fontset-font t 'unicode (font-spec :family "FontAwesome") nil 'append)
      (set-fontset-font t 'unicode (font-spec :family "Weather Icons") nil 'append)

      ;; (add-hook 'markdown-mode-hook 'ac-emoji-setup)

      (require 'font-lock))
#+end_src
** Casual
Contextual User Interfaces based on Transient (aka magit interface)
*** casual-editkit
User interface library for Emacs editing commands.
#+begin_src emacs-lisp
  ;; (use-package casual-editkit
  ;;       :ensure nil
  ;;       :bind (("<f2>" . casual-editkit-main-tmenu)))
#+end_src

* Key Bindings
:properties:
:header-args+: :tangle "./lisp/setup-keys.el"
:end:
Key bindings configuration module automatically tangled in =./lisp/setup-keys.el=
#+begin_src emacs-lisp :noweb yes
  ;;; setup-keys.el --- Key Bindings module -*- lexical-binding: t; buffer-read-only: t; no-byte-compile: t -*-

  <<nc-header>>
#+end_src
** Global Key Bindings
Some Emacs Global Bindings are redefined here.
#+begin_src emacs-lisp
  ;; Unbind unneeded keys
  (global-set-key (kbd "C-z") nil)
  (global-set-key (kbd "C-l") nil)
  (global-set-key (kbd "M-z") nil)
  (global-set-key (kbd "C-x C-z") nil)
  (global-set-key (kbd "M-o") nil)
  (global-set-key (kbd "M-SPC") nil)


  (global-set-key (kbd "C-+") #'text-scale-increase)
  (global-set-key (kbd "C--") #'text-scale-decrease)

  ;; Prefer backward-kill-word over Backspace
  (global-set-key (kbd "C-w") #'backward-kill-word)
  (global-set-key (kbd "C-x C-k") #'kill-region)

  (global-set-key (kbd "C-x C-r") #'recentf-open-files)

  ;; Move up/down paragraph
  (global-set-key (kbd "M-n") #'forward-paragraph)
  (global-set-key (kbd "M-p") #'backward-paragraph)
  (global-set-key (kbd "C-x c") #'compile)


  ;; Functions
  (bind-keys
   ("<f5>" . revert-buffer)
   ("C-<f5>" . magit-log-buffer-file)
   ("<f9>" . treemacs)
   ("<f11>" . nc/maximize-or-split-window-vertically)
   ("C-<f11>" . nc/split-window-horizontally)
   ("<f12>" . org-agenda)
   ("C-<f12>" . org-agenda))

  ;; Tools alt-[0-9]
  (bind-keys
   ("M-0" . nc/maximize-or-split-window-vertically))
#+end_src
** TODO Hydra



#+begin_src emacs-lisp
  (use-package hydra
    :ensure t
    :custom
    (hydra-default-hint nil))

  (use-package major-mode-hydra
    :ensure t)

  ;; Pretty Hydra
  (use-package pretty-hydra
    :ensure t)
#+end_src
*** nc-hydra-insert 
#+begin_src emacs-lisp
  (pretty-hydra-define nc-hydra-insert (:foreign-keys warn :title "Insert" :quit-key "q" :exit t)
    ("Insert"
     (("d" nc/insert-datestamp-inactive "Date InActive")
      ("D" nc/insert-datestamp "Date Active")
      ("p" nc/generate-password "Password")
      ("u" nc/uuid "UUID"))

     "Snippet"
     (("y" consult-yasnippet "Yasnippet")
      ("Y" yankpad-insert "Yankpad"))))
#+end_src

*** nc-hydra-goto 
#+begin_src emacs-lisp
  (pretty-hydra-define nc-hydra-goto (:foreign-keys warn :title "Goto" :quit-key "q" :exit t)
    ("Configuration"
     ((";" nc/goto-emacs-config "Emacs Config"))

      "Personal Files"
      (("i" nc/goto-inbox "Inbox")
       ("p" nc/goto-my-credentials "Passwords"))

     "Personal Dirs"
     (("A" nc/goto-archives-dir "Archives")
      ("N" nc/goto-notes-dir "Notes")
      ("P" nc/goto-projects-dir "Projects")
      ("T" nc/goto-templates-dir "Templates"))))
#+end_src

*** nc-hydra-toggles 
#+begin_src emacs-lisp
  (pretty-hydra-define nc-hydra-toggle
    (:color amaranth :quit-key "q" :title "Toggles")
    ("Basic"
     (("n" linum-mode "line number" :toggle t)
      ("w" whitespace-mode "whitespace" :toggle t)
      ;;("W" whitespace-cleanup-mode "whitespace cleanup" :toggle t)
      ("r" rainbow-mode "rainbow" :toggle t))
     "Highlight"
     (("l" hl-line-mode "line" :toggle t))
     "Coding"
     (("p" smartparens-mode "smartparens" :toggle t)
      ("P" smartparens-strict-mode "smartparens strict" :toggle t)
      ("S" show-smartparens-mode "show smartparens" :toggle t)
      ("e" eldoc-mode "eldoc" :toggle t))
     "Emacs"
     (("D" toggle-debug-on-error "debug on error" :toggle (default-value 'debug-on-error))
      ("X" toggle-debug-on-quit "debug on quit" :toggle (default-value 'debug-on-quit)))))
#+end_src
*** hydra windows
#+begin_src emacs-lisp
  (pretty-hydra-define nc-hydra-windows
      (:color amaranth :quit-key "q" :title "Windows" :exit t)
      ("Move"
       (("v" nc/maximize-or-split-window-vertically "Maximize or Split Window V")
        ("h" nc/split-window-horizontally "Split Window H"))))
#+end_src

*** hydra org-mode
#+begin_src emacs-lisp
  (major-mode-hydra-define org-mode nil
    ("GTD"
     (("s" nc/org-insert-daily-review "Start Daily Review")
      ("d" nc/insert-daily-heading "Insert Daily Heading"))
     "Actions"
     (("r" nc/org-refile-subtree-to-file "Refile subtree to file")
      ("A" nc/create-buffer-attachment-directory "Create attachment directory"))
     "Search"
     (("?" nc/search-notes "Search Notes"))))
#+end_src

** Key Chords

#+begin_src emacs-lisp
  (use-package key-chord
    :init
    (key-chord-mode 1)
    (key-chord-define-global "FF" 'projectile-find-file)
    (key-chord-define-global "::" 'avy-goto-char-timer)
    (key-chord-define-global "GG" 'consult-ripgrep)  
    (key-chord-define-global "OO" 'consult-outline)
    (key-chord-define-global "DD" 'delete-region)
    (key-chord-define-global "??" 'nc/search-notes) 
    (key-chord-define-global "BB" 'beginning-of-buffer)
    (key-chord-define-global "JJ" 'crux-top-join-line)
    (key-chord-define-global "MM" 'nc/maximize-or-split-window-vertically)
    (key-chord-define-global "$$" 'end-of-buffer))
#+end_src

** Which Key

[[https://github.com/justbur/emacs-which-key][Which Key]] is a minor mode for Emacs that displays the key bindings following
your currently entered incomplete command (a prefix) in a popup.

#+begin_src emacs-lisp
  (use-package which-key
    :diminish
    :custom
    (which-key-separator " ")
    (which-key-prefix-prefix "+")
    :config
    (which-key-mode)
    (which-key-enable-god-mode-support))
#+end_src
** My Universal Key Binding

🚧 Experimental : inspired by https://summeremacs.github.io/posts/universal-keybind/ 

See also : https://github.com/pivaldi/pimacs/tree/master/doc

#+begin_src emacs-lisp

(global-set-key (kbd "C-q") nil)

(defvar-keymap prefix-buffer-map-d
  :doc "Prefix map for C-q for dired/Denote"
  "j" #'dired
  "s" #'denote-sort-dired
  ;; "d" prefix-buffer-map-denote
  )


(defvar-keymap prefix-buffer-map-i
    :doc "Prefix map for C-q for Insert"
    "d" #'nc/insert-datestamp-inactive
    "D" #'nc/insert-datestamp
    "p" #'nc/generate-password
    "t" #'tempel-insert
    "u" #'nc/uuid
    "y" #'consult-yasnippet
    "Y" #'yankpad-insert)

(defvar-keymap prefix-buffer-map-g
  :doc "Prefix map for C-q for goto my files or folders"
  ";" #'nc/goto-emacs-config
  "i" #'nc/goto-inbox
  "p" #'nc/goto-my-credentials
  "A" #'nc/goto-archives-dir
  "N" #'nc/goto-notes-dir
  "P" #'nc/goto-projects-dir
  "T" #'nc/goto-templates-dir
  )

(defvar-keymap prefix-buffer-map-j
  :doc "Prefix map for C-q for jump"
  "j" #'avy-goto-char-timer
  "i" #'imenu
  "o" #'occur
  "d" #'dired-jump)

(defvar-keymap prefix-buffer-map-s
  :doc "Prefix map for C-q for Search"
  "f" #'nc/consult-fd-my-projects
  "n" #'nc/search-notes
  "r" #'nc/consult-rg-my-projects)


(defvar-keymap prefix-buffer-map-t
  :doc "Prefix map for C-q for GTD/org mode"
  "D" #'toggle-debug-on-error
  "P" #'smartparens-strict-mode
  "S" #'show-smartparens-mode
  "X" #'toggle-debug-on-quit
  "e" #'eldoc-mode
  "l" #'hl-line-mode
  "n" #'linum-mode
  "p" #'smartparens-mode
  "r" #'rainbow-mode
  "t" #'treemacs
  "w" #'whitespace-mode)

(defvar-keymap prefix-command-q
  :doc "Prefix Map for C-q:"
  ";" #'nc/goto-emacs-config
  "a" #'embark-act
  "d" prefix-buffer-map-d
  "e" #'casual-editkit-main-tmenu
  "g" prefix-buffer-map-g
  "h" #'major-mode-hydra
  "i" prefix-buffer-map-i
  "j" prefix-buffer-map-j
  "s" prefix-buffer-map-s
  "t" prefix-buffer-map-t)


(which-key-add-keymap-based-replacements prefix-command-q
  "d" `("Dired/Denote" . ,prefix-buffer-map-d)
  ;; "d d" `("Denote" . ,prefix-buffer-map-denote)
  "g" `("Goto My Files" . ,prefix-buffer-map-g)
  "i" `("Insert" . ,prefix-buffer-map-i)
  "j" `("Jump" . ,prefix-buffer-map-j)
  "t" `("Toggles" . ,prefix-buffer-map-t)
  ;; "m m" `("Mark" . ,prefix-buffer-map-mark)
  ;;"c" `("Casual" . ,prefix-buffer-map-casual)
  "s" `("Search" . ,prefix-buffer-map-s))

(keymap-set global-map "C-q" prefix-command-q)

#+end_src


* Windows
:properties:
:header-args+: :tangle "./lisp/setup-windows.el"
:end:

Windows configuration module automatically tangled in =./lisp/setup-windows.el=

#+begin_src emacs-lisp :noweb yes
  ;;; setup-windows.el --- Windows configuration file -*- lexical-binding: t; buffer-read-only: t; no-byte-compile: t -*-

  <<nc-header>>
#+end_src


** Ace Window
[[https://github.com/abo-abo/ace-window][ace-window]] Quickly switch and move windows

#+begin_src emacs-lisp
  (use-package ace-window
    :bind (([remap other-window] . ace-window)
           ("M-o" . ace-window))
    :config
    (setq aw-keys '(?q ?s ?d ?f ?g ?h ?j ?k ?l))
    ;; increase size face
    (custom-set-faces
     '(aw-leading-char-face
       ((t (:inherit ace-jump-face-foreground :height 3.0))))))
 #+end_src

** Golden Ratio

 [[https://github.com/roman/golden-ratio.el][Golden Ratio]] resize automatically the windows you are working

 #+begin_src emacs-lisp
   (use-package golden-ratio
     :diminish t
     :init
     (golden-ratio-mode 1)
     :config
     (setq golden-ratio-extra-commands
           (append golden-ratio-extra-commands
                   '(ace-window))))

   (defun nc/toggle-golden-ratio ()
     "Toggle golden ratio for widescreen"
     (interactive)
     (setq golden-ratio-adjust-factor .8))
 #+end_src


** Split Window Horizontally

Bound to =<my-prefix-map> w h=.
#+begin_src emacs-lisp
  (defun nc/split-window-horizontally ()
    (interactive)
    (if (= (count-windows) 2)
        (let* ((this-win-buffer (window-buffer))
               (next-win-buffer (window-buffer (next-window)))
               (this-win-edges (window-edges (selected-window)))
               (next-win-edges (window-edges (next-window)))
               (this-win-2nd (not (and (<= (car this-win-edges)
                                           (car next-win-edges))
                                       (<= (cadr this-win-edges)
                                           (cadr next-win-edges)))))
               (splitter
                (if (= (car this-win-edges)
                       (car (window-edges (next-window))))
                    'split-window-horizontally
                  'split-window-vertically)))
          (delete-other-windows)
          (let ((first-win (selected-window)))
            (funcall splitter)
            (if this-win-2nd (other-window 1))
            (set-window-buffer (selected-window) this-win-buffer)
            (set-window-buffer (next-window) next-win-buffer)
            (select-window first-win)
            (if this-win-2nd (other-window 1))))))
#+end_src


** Maximize or Split Window Vertically 
Split window right with =<my-prefix-map> w v= and move there.
If windows are splitted delete other windows.
#+begin_src emacs-lisp
  (defun nc--split-window-right-and-move-there-dammit ()
    (split-window-right)
    (windmove-right))

  (defun nc/maximize-or-split-window-vertically ()
    (interactive)
    (if (> (count-windows) 1)
        (delete-other-windows)
      (nc--split-window-right-and-move-there-dammit)))
  #+end_src


