.emacs.d/Readme.org
** Terraform

Needs Terraform LSP Server, not the latest version, works fine with =0.28.1=

#+begin_src shell :tangle no
    asdf plugin add terraform-ls
  asdf install terraform-ls 0.28.1
  asdf global terraform-ls 0.28.1
#+end_src

#+begin_src emacs-lisp
  (use-package terraform-mode
    :hook ((terraform-mode . lsp)))
#+end_src

** Rest Client

Verb is a package for Emacs which allows you to organize and send HTTP requests

ℹ️ To replace =restlient= wich is no longer maintained

#+begin_src emacs-lisp
  (use-package verb
    :config
    (setq verb-auto-kill-response-buffers nil) ; Response buffers killed before sending a request.

    )

  (with-eval-after-load 'org
    (define-key org-mode-map (kbd "C-c C-r") verb-command-map))

#+end_src
** Web
*** Web Mode
[[https://web-mode.org/][Web Mode]] major mode for editing HTML pages

#+begin_src emacs-lisp
  (use-package web-mode
    :mode (("\\.html\\'" . web-mode)
           ("\\.hbs\\'" . web-mode)
           ("\\.tag$" . web-mode)
           ("\\.ftl$" . web-mode)
           ("\\.jsp$" . web-mode)
           ("\\.vue$" . web-mode)
           ("\\.php$" . web-mode))
    :config
    (add-hook 'web-mode-hook (lambda ()
                               (setq web-mode-markup-indent-offset 4)
                               (setq web-mode-code-indent-offset 4))))

#+end_src

*** Javascript
[[https://github.com/mooz/js2-mode][JS2 mode]] improved javascript editing mode
#+begin_src emacs-lisp
(use-package js2-mode
  :mode "\\.js\\'"
  :init
  (defalias 'javascript-generic-mode 'js2-mode)
  :config
  (js2-imenu-extras-setup)
  (setq-default js-auto-indent-flag nil
                js2-strict-missing-semi-warning nil
                js-indent-level 2)

  ;; Don't override global M-j keybinding (join lines)
  (define-key js2-mode-map (kbd "M-j") nil))

#+end_src


** YAML

#+begin_src emacs-lisp
  (use-package yaml-ts-mode
    :mode ("\\.yaml\\'" "\\.yml\\'")
    :config
    (add-hook 'yaml-ts-mode-hook #'highlight-indent-guides-mode))

  (use-package yaml-pro
    :hook (yaml-ts-mode . yaml-pro-ts-mode)
    :config
    (defun yaml-pro-edit-initialize-buffer-filter-args-advice (args)
      (if-let ((mode (language-detection-detect-mode (buffer-string))))
          (cl-destructuring-bind (parent-buffer buffer initial-text type initialize path) args
            (let ((init-func (lambda ()
                               (funcall mode)
                               (when initialize
                                 (call-interactively initialize)))))
              (list parent-buffer buffer initial-text type init-func path)))
        args))
    (advice-add 'yaml-pro-edit-initialize-buffer :filter-args #'yaml-pro-edit-initialize-buffer-filter-args-advice)

    :bind
      (:map yaml-pro-ts-mode-map
            ("C-c j" . yaml-pro-ts-move-subtree-down)
            ("C-c k" . yaml-pro-ts-move-subtree-up)
            ("C-c f" . yaml-pro-format)))
#+end_src
* Shell
:properties:
:header-args+: :tangle "./lisp/setup-shell.el"
:end:

Shell configuration module automatically tangled in =./lisp/setup-shell.el=
#+begin_src emacs-lisp :noweb yes
  ;;; setup-shell.el --- Shell configuration module -*- lexical-binding: t; buffer-read-only: t; no-byte-compile: t -*-

  <<nc-header>>
#+end_src


** vterm 

Last emacs terminal emulator :  https://github.com/akermu/emacs-libvterm

[[https://github.com/jixiuf/vterm-toggle][vterm-toggle]] toggles between the Vterm buffer and the current editing buffer 

#+begin_src emacs-lisp
  (use-package vterm
    :commands vterm
    :unless is-windows
    :custom
    (vterm-disable-bold-font t)
    (vterm-disable-inverse-video nil)
    (vterm-disable-underline nil)
    (vterm-kill-buffer-on-exit t)
    (vterm-max-scrollback 9999)
    (vterm-shell "/bin/zsh")
    (vterm-term-environment-variable "xterm-256color"))

  (use-package vterm-toggle
    :custom
    ;; Show Vterm Buffer in bottom side
    (vterm-toggle-fullscreen-p nil)
    :unless is-windows
    :config
    (add-to-list 'display-buffer-alist
       '("\*vterm\*"
         (display-buffer-in-side-window)
         (window-height . 0.3)
         (side . bottom)
         (slot . 0)))

    :bind
    ("C-c s" . vterm-toggle)
    (:map vterm-mode-map
          ("C-<return>" . vterm-toggle-insert-cd)
          ("C-S-n" . vterm-toggle-forward)
          ("C-S-p" . vterm-toggle-backward)
          ))
#+end_src

** Eshell

Adapted from https://config.daviwil.com/emacs#eshell 

#+begin_src emacs-lisp
  (defun nc/map-line-to-status-char (line)
    (cond ((string-match "^?\\? " line) "?")))

  (defun nc/get-git-status-prompt ()
    (let ((status-lines (cdr (process-lines "git" "status" "--porcelain" "-b"))))
      (seq-uniq (seq-filter 'identity (mapcar 'nc/map-line-to-status-char status-lines)))))

  (defun nc/get-prompt-path ()
    (let* ((current-path (eshell/pwd))
           (git-output (shell-command-to-string "git rev-parse --show-toplevel"))
           (has-path (not (string-match "^fatal" git-output))))
      (if (not has-path)
        (abbreviate-file-name current-path)
        (string-remove-prefix (file-name-directory git-output) current-path))))

  ;; This prompt function mostly replicates my custom zsh prompt setup
  ;; that is powered by github.com/denysdovhan/spaceship-prompt.
  (defun nc/eshell-prompt ()
    (let ((current-branch (magit-get-current-branch))
          )
      (concat
       "\n"
       (propertize (system-name) 'face `(:foreground "#62aeed"))
       (propertize " > " 'face `(:foreground "white"))
       (propertize (nc/get-prompt-path) 'face `(:foreground "#82cfd3"))
       (when current-branch
         (concat
          (propertize " • " 'face `(:foreground "white"))
          (propertize (concat " " current-branch) 'face `(:foreground "#c475f0"))))

       (propertize " • " 'face `(:foreground "white"))
       (propertize (format-time-string "%I:%M:%S %p") 'face `(:foreground "#5a5b7f"))
       (if (= (user-uid) 0)
           (propertize "\n#" 'face `(:foreground "red2"))
         (propertize "\nλ" 'face `(:foreground "#aece4a")))
       (propertize " " 'face `(:foreground "white")))))

  (defun nc/eshell-configure ()

    (use-package xterm-color)

    (push 'eshell-tramp eshell-modules-list)
    (push 'xterm-color-filter eshell-preoutput-filter-functions)
    (delq 'eshell-handle-ansi-color eshell-output-filter-functions)

    ;; Save command history when commands are entered
    (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

    (add-hook 'eshell-before-prompt-hook
              (lambda ()
                (setq xterm-color-preserve-properties t)))

    ;; Truncate buffer for performance
    (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

    ;; We want to use xterm-256color when running interactive commands
    ;; in eshell but not during other times when we might be launching
    ;; a shell command to gather its output.
    (add-hook 'eshell-pre-command-hook
              (lambda () (setenv "TERM" "xterm-256color")))
    (add-hook 'eshell-post-command-hook
              (lambda () (setenv "TERM" "dumb")))

    ;; Use completion-at-point to provide completions in eshell
    (define-key eshell-mode-map (kbd "<tab>") 'completion-at-point)
    (define-key eshell-mode-map (kbd "C-r") 'consult-history)

    ;; Visual Commands
    (require 'em-term)
    (setq eshell-visual-commands '("vi" "screen" "top" "less" "more" "lynx"
                                   "ncftp" "pine" "tin" "trn" "elm" "htop" "node" "npm")
          eshell-visual-subcommands '(("git" "log" "diff" "show")))

    ;; Initialize the shell history
    (eshell-hist-initialize)

    (setenv "PAGER" "cat")

    (setq eshell-prompt-function      'nc/eshell-prompt
          eshell-prompt-regexp        "^λ "
          eshell-history-size         10000
          eshell-buffer-maximum-lines 10000
          eshell-hist-ignoredups t
          eshell-highlight-prompt t
          eshell-scroll-to-bottom-on-input t
          eshell-prefer-lisp-functions nil))

  (use-package eshell
    :after esh-mode
    :hook (eshell-first-time-mode . nc/eshell-configure)

    :config

    (defun nc/eshell-clear-buffer ()
      "Clear terminal"
      (interactive)
      (let ((inhibit-read-only t))
        (erase-buffer)
        (eshell-send-input)))


    (defun nc/eshell-quit-or-delete-char (arg)
      (interactive "p")
      (if (and (eolp) (looking-back eshell-prompt-regexp))
          (progn
            (eshell-life-is-too-much) ; Why not? (eshell/exit)
            (ignore-errors
              (delete-window)))
        (delete-forward-char arg)))

    :bind
    (:map eshell-mode-map
          ("C-d" . nc/eshell-quit-or-delete-char)
          ("C-l" . nc/eshell-clear-buffer))

    )

  (add-hook 'eshell-mode-hook (lambda () (setenv "TERM" "xterm-256color")))
#+end_src


*** eshell-toggle


#+begin_src emacs-lisp
  (use-package eshell-toggle
    :custom
    (eshell-toggle-size-fraction 3)
    (eshell-toggle-use-projectile-root t)
    (eshell-toggle-run-command nil)
    :bind ("C-c e" . eshell-toggle))
#+end_src
** TODO dwim-shell-command

FIX : Path to plantuml ??

#+begin_src emacs-lisp
  (use-package dwim-shell-command
    :demand t ;; forces package loading
    :bind (([remap shell-command] . dwim-shell-command)
           :map dired-mode-map
           ([remap dired-do-async-shell-command] . dwim-shell-command)
           ([remap dired-do-shell-command] . dwim-shell-command)
           ([remap dired-smart-shell-command] . dwim-shell-command))
    :config
    (defun nc/dwim-shell-command-plantuml-to-png ()
      "Render plantuml file into PNG"
      (interactive)
      (dwim-shell-command-on-marked-files
       "Render to puml"
       "plantuml.bat '<<f>>'"
       :extensions "puml"
       :utils "java"
       :on-completion
       (lambda (buffer _process)
         (with-current-buffer buffer
           (save-excursion
             (goto-char 0)
             (when (re-search-forward "output='\\(.*\\)'" nil t)
                 (find-file-other-window (match-string-no-properties 1))
                 (kill-buffer buffer)
               )))))
      )
     (bind-key "C-c C-! e" #'nc/dwim-shell-command-plantuml-to-png)
     (defun nc/dwim-run-pytest ()
      "Run pytest on marked file"
      (interactive)
      (dwim-shell-command-on-marked-files
       "Run pytest"
       "pytest --color=yes -k <<f>>"
       :extensions "py"
       :utils "pytest"
       :error-autofocus t
       :silent-success t
       )
      )
     (bind-key "C-c C-! t" #'nc/dwim-run-pytest 'python-mode-map)
     
    )
#+end_src


* Custom Functions
:properties:
:header-args+: :tangle "./lisp/setup-functions.el"
:end:

Custom functions module automatically tangled in =./lisp/setup-functions.el=
#+begin_src emacs-lisp :noweb yes
  ;;; setup-functions.el --- Custom functions module -*- lexical-binding: t; buffer-read-only: t; no-byte-compile: t -*-

  <<nc-header>>
#+end_src

** Emacs Config File

 #+begin_src emacs-lisp
   (defun nc/goto-emacs-config ()
       "Edit Readme.org"
       (interactive)
       (find-file "~/.emacs.d/Readme.org"))     
 #+end_src

** My personal credentials

#+begin_src emacs-lisp
    (defun nc/goto-my-credentials ()
      "Goto my credentials"
      (interactive)
      ;; before disable super-save-mode
      ;;(super-save-stop)
      (find-file (concat nc/org-default-personal-dir "/password.gpg")))
#+end_src


** Pseudo uuid

Generate a 32 random pseudo uuid

#+begin_src emacs-lisp
  (defun nc--random-alnum ()
    (let* ((alnum "abcdef0123456789")
           (i (% (abs (random)) (length alnum))))
      (substring alnum i (1+ i))))

  (defun nc/uuid ()
    "Generate a pseudo UUID"
    (interactive)
    (dotimes (i 32) (insert (nc--random-alnum))))
#+end_src


** Password generator
Generates a strong password

 #+begin_src emacs-lisp
   (defun nc--random-char ()
       (let* ((alnum "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ-/%+*?&#[]()={}_<>!$,;:^µ0123456789")
              (i (% (abs (random)) (length alnum))))
         (substring alnum i (1+ i))))


   (defun nc/generate-password ()
       "Generates a strong password"
       (interactive)
       (dotimes (i 12) (insert (nc--random-char))))
 #+end_src

** TimeSlot
Insert time slot mainly used when I schedule meeting or appointment.
#+begin_src emacs-lisp
  (defvar current-hour-format "%H:00")

  (defun nc/insert-time-slot ()
    "Insert Time Slot"
    (interactive)
    (let ((begin (format-time-string current-hour-format (current-time)))
          (end (format-time-string current-hour-format (time-add (current-time) (seconds-to-time 3600)))))
      (insert (concat begin "-" end))))
#+end_src

** Inserting time stamps
   From : https://github.com/novoid/dot-emacs/blob/master/config.org#inserting-time-stamps--my-map-ddtt

#+begin_src emacs-lisp
  (defun nc/insert-datestamp ()
    "Insert the current date in yyyy-mm-dd format."
    (interactive "*")
    (if (eq major-mode 'org-mode)
        (progn
          (org-insert-time-stamp nil nil nil)
          (insert " "))
        (insert (format-time-string "%Y-%m-%d" (current-time)))))
 #+end_src


 #+begin_src emacs-lisp
   (defun nc/insert-datestamp-inactive ()
     "Insert the current date in yyyy-mm-dd format."
     (interactive "*")
     (if (eq major-mode 'org-mode)
         (progn
       (org-insert-time-stamp nil nil t)
       (insert " "))
       (insert (format-time-string "%Y-%m-%d" (current-time)))))
 #+end_src

** Searching in my notes

#+begin_src emacs-lisp
  (defun nc/search-notes ()
    "Search in all my org notes"
    (interactive)
    (let ((consult-ripgrep-command "rg --null --ignore-case --type org --line-buffered --color=always --max-columns=500 --no-heading --line-number . -e ARG OPTS"))
      (consult-ripgrep org-directory)))

#+end_src
** Sudo Edit File

From : https://karthinks.com/software/fifteen-ways-to-use-embark/

#+begin_src emacs-lisp
      (defun nc/sudo-find-file (file)
        "Open FILE as root."
        (interactive "FOpen file as root: ")
        (when (file-writable-p file)
          (user-error "File is user writeable, aborting sudo"))
        (find-file (if (file-remote-p file)
                       (concat "/" (file-remote-p file 'method) ":"
                               (file-remote-p file 'user) "@" (file-remote-p file 'host)
                               "|sudo:root@"
                               (file-remote-p file 'host) ":" (file-remote-p file 'localname))
                     (concat "/sudo:root@localhost:" file))))
#+end_src
** Getting Ready
Experimental get Ready
#+begin_src elisp
  (defun nc/getting-ready()
    "Getting Ready"
    (interactive)
    (toggle-frame-maximized)
    (split-window-vertically)
    (nc/goto-journal-file)
    (org-roam-node-random))
#+end_src

* Provided modules

** =setup-prefs= module
#+begin_src emacs-lisp :tangle ./lisp/setup-prefs.el
  (provide 'setup-prefs)
  ;;; setup-prefs.el ends here
#+end_src


** =setup-ui= module
#+begin_src emacs-lisp :tangle ./lisp/setup-ui.el
  (provide 'setup-ui)
  ;;; setup-ui.el ends here
#+end_src


** =setup-keys= module
#+begin_src emacs-lisp :tangle ./lisp/setup-keys.el
  (provide 'setup-keys)
  ;;; setup-keys.el ends here
#+end_src

** =setup-windows= module
#+begin_src emacs-lisp :tangle ./lisp/setup-windows.el
  (provide 'setup-windows)
  ;;; setup-windows.el ends here
#+end_src



** =setup-core= module
#+begin_src emacs-lisp :tangle ./lisp/setup-core.el
  (provide 'setup-core)
  ;;; setup-core.el ends here
#+end_src
** =setup-completion= module
#+begin_src emacs-lisp :tangle ./lisp/setup-completion.el
  (provide 'setup-completion)
  ;;; setup-completion.el ends here
#+end_src


** =setup-org= module
#+begin_src emacs-lisp :tangle ./lisp/setup-org.el
  (provide 'setup-org)
  ;;; setup-org.el ends here
#+end_src

